Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/svd/WBZ350.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CFG</name>
         <version>chip_cfg_pbA</version>
         <baseAddress>0x44000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x204</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CFGCON0</name>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x7100000b</resetValue>
               <fields>
                  <field>
                     <name>SWOEN</name>
                     <description>SWO enable on 2-wire debug interface</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TROEN</name>
                     <description>Trace Output Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JTAGEN</name>
                     <description>JTAG Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCPOVR</name>
                     <description>ADC Charge Pump Override</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCMP1_ALTEN</name>
                     <description>AC CMP1 Alternate Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPENFILT</name>
                     <description>ADC CP Filter Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCIN0_ALTEN</name>
                     <description>RTCIN0 Alternate Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCOUT_ALTEN</name>
                     <description>RTCOUT Alternate Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PMULOCK</name>
                     <description>PMU Controller Register LOCK</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGLCOK</name>
                     <description>Permission Group LOCK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PMDLOCK</name>
                     <description>Peripheral Module Disable (PMD) LOCK</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOLOCK</name>
                     <description>IO LOCK</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGCLOCK</name>
                     <description>Configuration Register Lock</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SMBUSEN0</name>
                     <description>SMBus Enable for SERCOM0</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBUSEN1</name>
                     <description>SMBus Enable for SERCOM1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPLUGDIS</name>
                     <description>Hot Plugging Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLRTEN0</name>
                     <description>SLRT Enable for SERCOM0</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLRTEN1</name>
                     <description>SLRT Enable for SERCOM1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCM</name>
                     <description>PCHE I/D Cacheable Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT0E</name>
                     <description>INT0 Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT0P</name>
                     <description>INT0P Polarity</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FECCCON</name>
                     <description>Flash ECC Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FRECCDIS</name>
                     <description>Flex RAM ECC Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGCON1</name>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x1f00403b</resetValue>
               <fields>
                  <field>
                     <name>TRCEN</name>
                     <description>Trace Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC_SEL_MEM</name>
                     <description>ECC row selection bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZBTWKSYS</name>
                     <description>ZBT Subsystem External Wake-up source</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP0_OE</name>
                     <description>Analog Comparator-0 Output Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1_OE</name>
                     <description>Analog Comparator-1 Output Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLRCTRL0</name>
                     <description>I2C Slew Rate Control for SERCOM0</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLRCTRL1</name>
                     <description>I2C Slew Rate Control for SERCOM1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMCLR</name>
                     <description>Selects CRU handling of MCLR Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QSCHE_EN</name>
                     <description>QSPI Address Space Cache Attribute</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QSPI_HSEN</name>
                     <description>QSPI (Direct) Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCOM0_HSEN</name>
                     <description>SERCOM0 (Direct)High Speed Pin Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCOM1_HSEN</name>
                     <description>SERCOM1 (Direct)High Speed Pin Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCL_OE</name>
                     <description>CCL Pads (via PPS) Output Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2CDSEL0</name>
                     <description>I2C Delay Select for SERCOM0</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2CDSEL1</name>
                     <description>I2C Delay Select for SERCOM1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDTPSS</name>
                     <description>Watchdog Timer Post-scale Select Sleep</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QSPIDDRM</name>
                     <description>QSPI DDR Mode Clock Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKZBREF</name>
                     <description>External Reference Clock ZB Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGCON2</name>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x7f7fff38</resetValue>
               <fields>
                  <field>
                     <name>ACMP_CYCLE</name>
                     <description>AC SIB Comparator Result Wait Cycles</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DMTINTV</name>
                     <description>Dead Man Timer Count Window Interval</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PMUTEST_VDD_EN</name>
                     <description>PMU Test Output or VDD/2 Enable via ADC IE12</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSCMOD</name>
                     <description>Primary Oscillator Configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>WDTRMCS</name>
                     <description>WDT RUN Mode Clock Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SOSCSEL</name>
                     <description>SOSC Selection Configuration</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKE2SPD</name>
                     <description>2-Speed startup enabled in Sleep mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKSWEN</name>
                     <description>Software Clock Switching Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSCMEN</name>
                     <description>Fail-Safe Clock Monitor Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDTPSR</name>
                     <description>Watchdog Timer Post-scale Select Run</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>WDTSPGM</name>
                     <description>Watchdog Timer Stop during Flash Programming</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINDIS</name>
                     <description>Windowed Watchdog Timer Disable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDTEN</name>
                     <description>Watchdog Timer Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDTWINSZ</name>
                     <description>Watchdog Timer Window Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DMTCNT</name>
                     <description>Dead Man Timer Count Select</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DMTEN</name>
                     <description>Dead Man Timer Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGCON4</name>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x840e4000</resetValue>
               <fields>
                  <field>
                     <name>SOSC_CFG</name>
                     <description>SOSC Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RTCEVENT_SEL</name>
                     <description>RTC Event Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RTCEVENT_EN</name>
                     <description>Pad Output Enable for MCHP legacy RTC event output</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBKP_1KCSEL</name>
                     <description>VDDBUKPCORE LPCLK Clock Selection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBKP_32KCSEL</name>
                     <description>VDDBUKPCORE 32KHz clock source selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>VBKP_DIVSEL</name>
                     <description>VDDBUKPCORE LPCLK Clock Divider Selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPCLK_MOD</name>
                     <description>LPCLK modifier in counter/delay mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCEVTYPE</name>
                     <description>RTC Event Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPEN_DLY</name>
                     <description>Charge-pump ready digital delay</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DSZPBOREN</name>
                     <description>Deep Sleep Zero-Power BOR Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSWDTPS</name>
                     <description>Deep Sleep Watchdog Timer Postscale Select</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DSWDTOSC</name>
                     <description>Deep Sleep Watchdog Timer Reference Clock Select</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSWDTEN</name>
                     <description>Deep Sleep Watchdog Timer Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSEN</name>
                     <description>Deep Sleep Bit Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UVREGROVR</name>
                     <description>ULPVREG Retention Mode Override</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPOSCEN</name>
                     <description>Low Power (Secondary) Oscillator Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCNTM_CSEL</name>
                     <description>RTC Counter Mode Clock Select</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGPGQOS</name>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0xe044004c</resetValue>
               <fields>
                  <field>
                     <name>CPUPG</name>
                     <description>CPU (Code) Permission Group</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CPUQOS</name>
                     <description>CPU I/D and System Bus QOS Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DMAPG</name>
                     <description>DMA (Rd/Wr) Permission Group</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DGISPIPG</name>
                     <description>ADC Controller Permission Group</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DGISPIQOS</name>
                     <description>ADC Controller QOS Control</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CRYPTOPG</name>
                     <description>Crypto Permission Group</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CRYPTOQOS</name>
                     <description>Crypto QOS Control</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DSUPG</name>
                     <description>DSU Permission Group</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FCQOS</name>
                     <description>FC Controller QOS Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>WISIBQOS</name>
                     <description>Wireless SIB QOS Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
