Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/svd/WBZ350.svd
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC8CD</name>
                     <description>EVSYSC8 Clock Disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC8CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGPCLKGEN3</name>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVSYSC9SEL</name>
                     <description>EVSYSC9 Peripheral Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC9SELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC9CD</name>
                     <description>EVSYSC9 Clock Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC9CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC10SEL</name>
                     <description>EVSYSC10 Peripheral Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC10SELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC10CD</name>
                     <description>EVSYSC10 Clock Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC10CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC11SEL</name>
                     <description>EVSYSC11 Peripheral Clock Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC11SELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC11CD</name>
                     <description>EVSYSC11 Clock Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC11CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC12SEL</name>
                     <description>EVSYSC12 Peripheral Clock Selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC12SELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVSYSC12CD</name>
                     <description>EVSYSC12 Clock Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EVSYSC12CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACCSEL</name>
                     <description>AC Peripheral Clock Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>ACCSELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACCD</name>
                     <description>AC Clock Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACCDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCC0CSEL</name>
                     <description>TCC0 Peripheral Clock Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TCC0CSELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCC0CD</name>
                     <description>TCC0 Clock Disable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TCC0CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
