Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/svd/WBZ350.svd
            <register>
               <name>TC3WO0G1R</name>
               <addressOffset>0xd8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC3WO0</name>
                     <description>TC3/WO0G1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC3WO0Select</name>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC3WO0G3R</name>
               <addressOffset>0xdc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC3WO0</name>
                     <description>TC3/WO0G3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC3WO0Select</name>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC3WO1G2R</name>
               <addressOffset>0xe0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC3WO1</name>
                     <description>TC3/WO1G2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC3WO1Select</name>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC3WO1G4R</name>
               <addressOffset>0xe4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC3WO1</name>
                     <description>TC3/WO1G4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC3WO1Select</name>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC4WO0G1R</name>
               <addressOffset>0xe8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC4WO0</name>
                     <description>TC4/WO0G1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC4WO0Select</name>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC4WO0G3R</name>
               <addressOffset>0xec</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC4WO0</name>
                     <description>TC4/WO0G3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC4WO0Select</name>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC4WO1G2R</name>
               <addressOffset>0xf0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC4WO1</name>
                     <description>TC4/WO1G2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC4WO1Select</name>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC4WO1G4R</name>
               <addressOffset>0xf4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC4WO1</name>
                     <description>TC4/WO1G4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC4WO1Select</name>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC5WO0G1R</name>
               <addressOffset>0xf8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC5WO0</name>
                     <description>TC5/WO0G1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC5WO0Select</name>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
