Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/svd/WBZ350.svd
            <register>
               <name>TC7WO1G2R</name>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC7WO1</name>
                     <description>TC7/WO1G2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC7WO1Select</name>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC7WO1G4R</name>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TC7WO1</name>
                     <description>TC7/WO1G4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TC7WO1Select</name>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPA3G1R</name>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPA3G1R</name>
                     <description>RPA3/G1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>RPA3G1RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P1</name>
                           <description>SERCOM0/PAD1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P1</name>
                           <description>SERCOM1/PAD1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>REFO1</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>REFO2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>REFO3</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>REFO4</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSCK</name>
                           <description>QSCK</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPA3G2R</name>
               <addressOffset>0x21c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPA3G2R</name>
                     <description>RPA3/G2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>RPA3G2RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P0</name>
                           <description>SERCOM0/PAD0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P3</name>
                           <description>SERCOM0/PAD3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P2</name>
                           <description>SERCOM0/PAD2</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P3</name>
                           <description>SERCOM1/PAD3</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P2</name>
                           <description>SERCOM1/PAD2</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO1</name>
                           <description>TCC0/WO1</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO5</name>
                           <description>TCC0/WO5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO3</name>
                           <description>TCC0/WO3</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO1</name>
                           <description>TCC1/WO1</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO5</name>
                           <description>TCC1/WO5</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO3</name>
                           <description>TCC1/WO3</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2WO1</name>
                           <description>TCC2/WO1</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0WO1</name>
                           <description>TC0/WO1</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1WO1</name>
                           <description>TC1/WO1</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2WO1</name>
                           <description>TC2/WO1</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC3WO1</name>
                           <description>TC3/WO1</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4WO1</name>
                           <description>TC4/WO1</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC5WO1</name>
                           <description>TC5/WO1</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6WO1</name>
                           <description>TC6/WO1</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC7WO1</name>
                           <description>TC7/WO1</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPICS</name>
                           <description>QSPI/CS</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD0</name>
                           <description>QD0</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD3</name>
                           <description>QD3</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD2</name>
                           <description>QD2</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CCLOUT1</name>
                           <description>CCLOUT1</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS0</name>
                           <description>TSTBUS0</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS3</name>
                           <description>TSTBUS3</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS6</name>
                           <description>TSTBUS6</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS9</name>
                           <description>TSTBUS9</description>
                           <value>31</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPA3G3R</name>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPA3G3R</name>
                     <description>RPA3/G3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>RPA3G3RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P0</name>
                           <description>SERCOM0/PAD0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P3</name>
                           <description>SERCOM0/PAD3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P2</name>
                           <description>SERCOM1/PAD2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P3</name>
                           <description>SERCOM1/PAD3</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO2</name>
                           <description>TCC0/WO2</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO0</name>
                           <description>TCC0/WO0</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO4</name>
                           <description>TCC0/WO4</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO2</name>
                           <description>TCC1/WO2</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO0</name>
                           <description>TCC1/WO0</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO4</name>
                           <description>TCC1/WO4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2WO0</name>
                           <description>TCC2/WO0</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0WO0</name>
                           <description>TC0/WO0</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1WO0</name>
                           <description>TC1/WO0</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2WO0</name>
                           <description>TC2/WO0</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC3WO0</name>
                           <description>TC3/WO0</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4WO0</name>
                           <description>TC4/WO0</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC5WO0</name>
                           <description>TC5/WO0</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6WO0</name>
                           <description>TC6/WO0</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC7WO0</name>
                           <description>TC7/WO0</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QCS</name>
                           <description>QCS</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD1</name>
                           <description>QD1</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD0</name>
                           <description>QD0</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD3</name>
                           <description>QD3</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CCLOUT0</name>
                           <description>CCLOUT0</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS1</name>
                           <description>TSTBUS1</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS4</name>
                           <description>TSTBUS4</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS7</name>
                           <description>TSTBUS7</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS10</name>
                           <description>TSTBUS10</description>
                           <value>31</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
