Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/WBZ35/svd/WBZ350.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM1</name>
         <baseAddress>0x40001000</baseAddress>
         <interrupt>
            <name>SERCOM1</name>
            <description>Serial Communication Interface 1</description>
            <value>13</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SILEX</name>
         <version>005851.0.0</version>
         <baseAddress>0x43000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1405C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SILEX_0</name>
            <description>Crypto 0</description>
            <value>27</value>
         </interrupt>
         <interrupt>
            <name>SILEX_1</name>
            <description>Crypto 1</description>
            <value>28</value>
         </interrupt>
         <registers>
            <register>
               <name>CRYPTOCON</name>
               <description>Crypto control register.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable clock to SILEX</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Enable clock in idle mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>1</dim>
               <dimIncrement>0x405C</dimIncrement>
               <name>SFR[%s]</name>
               <description/>
               <addressOffset>0x10000</addressOffset>
               <register>
                  <name>DMA_FETCH_ADDR_LSB</name>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FETCH_ADDR_LSB</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_FETCH_ADDR_MSB</name>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FETCH_ADDR_MSB</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_FETCH_LEN</name>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FETCH_LEN</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>28</bitWidth>
                     </field>
                     <field>
                        <name>FETCH_CSTADDR</name>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FETCH_REALIGN</name>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FETCH_ZPADDING</name>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_FETCH_TAG</name>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FETCH_TAG</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_PUSH_ADDR_LSB</name>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PUSH_ADDR_LSB</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_PUSH_ADDR_MSB</name>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PUSH_ADDR_MSB</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_PUSH_LEN</name>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PUSH_LEN</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>28</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_CSTADDR</name>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_REALIGN</name>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_DISCARD</name>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_INT_EN</name>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>INT_EN</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_INT_ENSET</name>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>INT_ENSET</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_INT_ENCLR</name>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>INT_ENCLR</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_INT_STATRAW</name>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>INT_STATRAW</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_INT_STAT</name>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>INT_STAT</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_INT_STATCLR</name>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>INT_STATCLR</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_CONFIG</name>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FETCH_CTRL_INDIRECT</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_CTRL_INDIRECT</name>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FETCH_STOP</name>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_STOP</name>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFT_RST</name>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_START</name>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>START_FETCH</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>START_PUSH</name>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DMA_STATUS</name>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FETCH_BUSY</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_BUSY</name>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FETCH_NOT_EMPTY</name>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_WAITINGFIFO</name>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFT_RST_BUSY</name>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PUSH_NBDATA</name>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HWCONF_INCL_IPS_HW_CFG</name>
                  <addressOffset>0x400</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BA411_AES_INCLUDED</name>
                        <description>Generic g_IncludeAES value. BA411E-AES IP included if set</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA415_HP_AES_GCM_INCLUDED</name>
                        <description>Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA416_HP_AES_XTS_INCLUDED</name>
                        <description>Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA412_DES_INCLUDED</name>
                        <description>Generic g_IncludeDES value. BA412-3DES IP included if set</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA413_HASH_INCLUDED</name>
                        <description>Generic g_IncludeHASH value. BA413-HASH IP included if set</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA417_CHACHAPOLY_INCLUDED</name>
                        <description>Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA418_SHA3_INCLUDED</name>
                        <description>Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA421_ZUC_INCLUDED</name>
                        <description>Generic g_IncludeZUC  value. BA421-ZUC IP included if set</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA419_SM4_INCLUDED</name>
                        <description>Generic g_IncludeSM4  value. BA419-SM4 IP included if set</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA414EP_PKE_INCLUDED</name>
                        <description>Generic g_IncludePKE  value. BA414EP-PKE IP included if set</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA431_NDRNG_INCLUDED</name>
                        <description>Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA420_HP_CHACHAPOLY_INCLUDED</name>
                        <description>Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA423_SNOW3G_INCLUDED</name>
                        <description>Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA422_KASUMI_INCLUDED</name>
                        <description>Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HWCONF_BA411E_AES_HW_CFG_1</name>
                  <addressOffset>0x404</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BA411E_AES_HW_CFG_MODE</name>
                        <description>Generic g_AesModesPoss value. BA411E-AES engine configuration.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>BA411E_AES_HW_CFG_CS</name>
                        <description>Generic g_CS value. BA411E-AES engine configuration.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA411E_AES_HW_CFG_MASKING</name>
                        <description>Generic g_UseMasking value. BA411E-AES engine configuration.</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA411E_AES_HW_CFG_KEYSIZE</name>
                        <description>Generic g_Keysize value. BA411E-AES engine configuration.</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HWCONF_BA411E_AES_HW_CFG_2</name>
                  <description>Generic g_CtrSize value. BA411E-AES engine configuration.</description>
                  <addressOffset>0x408</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BA411E_AES_HW_CFG_2</name>
                        <description>Generic g_CtrSize value. BA411E-AES engine configuration.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HWCONF_BA413_HASH_HW_CFG</name>
                  <addressOffset>0x40C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BA413_HASH_HW_CFG_MASK</name>
                        <description>Generic g_HashMaskFunc value. BA413-Hash engine configuration.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>BA413_HASH_HW_CFG_PASSING</name>
                        <description>Generic g_HashPadding value. BA413-Hash engine configuration.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA413_HASH_HW_CFG_HMAC</name>
                        <description>Generic g_HMAC_enabled value. BA413-Hash engine configuration.</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BA413_HASH_HW_CFG_VERIFYDIGEST</name>
                        <description>Generic g_HashVerifyDigest value. BA413-Hash engine configuration.</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HWCONF_BA418_SHA3_HW_CFG</name>
                  <description>Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.</description>
                  <addressOffset>0x410</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BA418_SHA3_HW_CFG</name>
                        <description>Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
